Documents/УведомлениеОбОтсутствииОтветаСЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОбОтсутствииОтветаСЭДО</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросФССДляРасчетаПособия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждениеПолученоСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УведомлениеОбОтсутствииОтветаСЭДО/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)
	|	И ЗначениеРазрешено(ГоловнаяОрганизация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ТекущиеДела

Функция АктуальныеТребования()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Уведомление.Загружен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТребуетсяЗагрузить,
	|	СУММА(ВЫБОР
	|			КОГДА Уведомление.Загружен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТребуетсяОбработать
	|ИЗ
	|	Документ.УведомлениеОбОтсутствииОтветаСЭДО КАК Уведомление
	|ГДЕ
	|	Уведомление.ДатаСообщения >= &ДатаАктуальности
	|	И НЕ Уведомление.Обработан
	|	И НЕ Уведомление.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДатаАктуальности", НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -12)));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	МетаданныеДокумента = Метаданные();
	Если Не СЭДОФСС.ДоступенОбменЧерезСЭДО()
		Или Не ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
		Возврат; // Нет прав.
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта(МетаданныеДокумента.ПолноеИмя());
	Если Разделы.Количество() = 0 Тогда
		Возврат; // Некорректное внедрение.
	КонецЕсли;
	
	Требования = АктуальныеТребования();
	ТребуетсяЗагрузить = Требования.Итог("ТребуетсяЗагрузить");
	ТребуетсяОбработать = Требования.Итог("ТребуетсяОбработать");
	Всего = ТребуетсяЗагрузить + ТребуетсяОбработать;
	ИмяДокумента = МетаданныеДокумента.Имя;
	ПредставлениеСписка = МетаданныеДокумента.ПредставлениеСписка;
	
	Для Каждого Раздел Из Разделы Цикл
		
		ПолноеИмяРаздела = СтрЗаменить(Раздел.ПолноеИмя(), ".", "_");
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_ВРаботе_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (Всего > 0);
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = ПредставлениеСписка;
		Дело.Количество     = Всего;
		Дело.ПараметрыФормы = Новый Структура("ТолькоВРаботе", Истина);
		Дело.Форма          = "Документ.УведомлениеОбОтсутствииОтветаСЭДО.ФормаСписка";
		
		ИдентификаторРодителя = Дело.Идентификатор;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_Загрузить_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяЗагрузить > 0);
		Дело.Важное         = Ложь;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Получить новые'");
		Дело.Количество     = ТребуетсяЗагрузить;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_Ответить_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяОбработать > 0);
		Дело.Важное         = Ложь;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Ответить на запрос'");
		Дело.Количество     = ТребуетсяОбработать;
		
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ТекущиеДела

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПовторноОбработатьСообщения124");
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.38.35";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c4341d06-3295-11f1-8174-4cedfb43b11a");
	Обработчик.Процедура = "Документы.УведомлениеОбОтсутствииОтветаСЭДО.ПовторноОбработатьСообщения124";
	Обработчик.Комментарий = НСтр("ru = 'СЭДО: Обработка уведомлений об отсутствии ответа на запрос (тип 124).'");
	
КонецПроцедуры

// Обработка уведомлений об отсутствии ответа на запрос.
//
// Параметры:
//   ПараметрыОбновления - Структура - Параметры отложенного обновления.
//
Процедура ПовторноОбработатьСообщения124(ПараметрыОбновления = Неопределено) Экспорт
	СЭДОФСС.ПовторноОбработатьВходящиеСообщенияСЭДО(ПараметрыОбновления, 124, , , '20260101');
КонецПроцедуры

#КонецОбласти

#Область СЭДО

Функция ТипСообщения(Документ = Неопределено) Экспорт
	Возврат 124;
КонецФункции

Функция Метаданные() Экспорт
	Возврат Метаданные.Документы.УведомлениеОбОтсутствииОтветаСЭДО;
КонецФункции

#КонецОбласти

#Область СоставДокументов

// Возвращает описание состава документа
//
// Возвращаемое значение:
//   Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке(, "");
КонецФункции

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

Функция ПараметрыФиксацииВторичныхДанных() Экспорт
	Возврат ФиксацияВторичныхДанныхВДокументах.ПараметрыФиксации(ФиксируемыеРеквизиты());
КонецФункции

Функция ОбъектЗафиксирован(Документ) Экспорт
	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьУведомлениеОНаличииСообщения(ТипСообщения, Страхователь, Уведомление, ЕстьИзменения) Экспорт
	ИдентификаторСообщения = Уведомление.Идентификатор;
	
	Объект = СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения, Истина);
	Объект.ДатаСообщения = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения);
	Объект.ТребуетсяПодтверждение = Уведомление.ТребуетсяПодтверждение;
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Страхователь;
	КонецЕсли;
	СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК", РежимЗаписиДокумента.Запись);
	
	ЕстьИзменения = Истина;
КонецПроцедуры

// Загружает информацию о несоответствии сведений о застрахованном лице в базу данных.
Процедура ЗагрузитьСообщение(ТипСообщения, Страхователь, ИдентификаторСообщения, ТекстXML, ТребуетсяПодтверждение, Результат, Кэш) Экспорт
	// Пример:
	//<proactiveExpireNotice xmlns="urn:ru:fss:integration:types:proactive:notifications:v01">
	//	<socialAssistNum>5177644</socialAssistNum>
	//	<missingResponseToRequest>Информируем, что Страхователю по СНИЛС 37535959432 направлен запрос о представлении недостающих сведений и документов (сообщение № 100 СЭДО). Идентификатор запроса: "17674919-823f-4af7-8d54-093691d5398e", дата и время направления запроса: 2024-06-20 19:56:34.167. В установленный срок ответ от Страхователя в Социальный фонд России не поступил</missingResponseToRequest>
	//</proactiveExpireNotice>
	
	Объект = СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения, Ложь);
	Объект.ДатаСообщения = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения, Кэш);
	Объект.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	
	Если Не Объект.Загружен Тогда
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Загружен = Истина;
	КонецЕсли;
	
	// Поиск корневого узла.
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	КореньDOM = СериализацияБЗК.НайтиУзелDOMПоИмени(СтруктураDOM, "proactiveExpireNotice");
	Если КореньDOM = Неопределено Тогда
		КореньDOM = СтруктураDOM.ДокументDOM.ЭлементДокумента;
	КонецЕсли;
	
	// Чтение реквизитов.
	РеквизитыКорня = СериализацияБЗК.УзлыЭлементаDOM(КореньDOM, "socialAssistNum, missingResponseToRequest");
	Объект.НомерПроцесса = СериализацияБЗК.ЧислоИзXML(РеквизитыКорня.socialAssistNum);
	Объект.ТекстУведомления = СериализацияБЗК.СтрокаИзXML(РеквизитыКорня.missingResponseToRequest);
	
	Объект.ОбновитьВторичныеДанные();
	
	СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК", РежимЗаписиДокумента.Проведение);
	
	Результат.Обработано = Истина;
КонецПроцедуры

Процедура ЗагрузитьОтветНаПодтверждениеПолученияСообщения(Страхователь, ИсходноеСообщение, Результат, ЕстьИзменения) Экспорт
	// Вызывается при получении сообщения с типом 11 в ответ на подтверждение о прочтении входящего сообщения.
	//   Страхователь - СправочникСсылка.Организации - организация, получатель сообщения.
	//   ИсходноеСообщение - Структура:
	//     * ИдентификаторСообщения - Строка - идентификатор исходного сообщения СЭДО, по которому отправлялось подтверждение.
	//     * Тип                    - Число  - тип исходного сообщения СЭДО, по которому отправлялось подтверждение.
	//     * ТекстОшибки            - Строка - ошибка приема подтверждения.
	//     * ТекстПредупреждения    - Строка - предупреждение приема подтверждения.
	//   Результат - Структура - результат обработки сообщения:
	//     * Обработано      - Булево - признак того, что сообщение было успешно обработано.
	//     * ОшибкаОбработки - Булево - признак того, что при обработке сообщения возникла ошибка.
	//     * ОписаниеОшибки  - Строка - описание ошибки обработки.
	
	// Поиск документа по идентификатору сообщения.
	СтрокаТаблицы = НайтиДокументПоСообщению(Страхователь, ИсходноеСообщение.ИдентификаторСообщения);
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение подтверждения получения.
	ДокументОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
	Если ДокументОбъект.ЗаполнитьПодтверждениеПолучения(Неопределено) Тогда
		СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, "БЗК", РежимЗаписиДокумента.Проведение);
		ЕстьИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения, СнятьПометкуУдаления)
	СтрокаТаблицы = НайтиДокументПоСообщению(Страхователь, ИдентификаторСообщения);
	Если СтрокаТаблицы = Неопределено Тогда
		Объект = СоздатьДокумент();
		Объект.Страхователь = Страхователь;
		Объект.ИдентификаторСообщения = ИдентификаторСообщения;
		Объект.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	Иначе
		Объект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		Если СнятьПометкуУдаления И Объект.ПометкаУдаления Тогда
			Объект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	Возврат Объект;
КонецФункции

Функция НайтиДокументПоСообщению(Страхователь, ИдентификаторСообщения)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Страхователь КАК Страхователь,
	|	Шапка.ПометкаУдаления КАК ПометкаУдаления,
	|	Шапка.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение
	|ИЗ
	|	Документ.УведомлениеОбОтсутствииОтветаСЭДО КАК Шапка
	|ГДЕ
	|	Шапка.ИдентификаторСообщения = &ИдентификаторСообщения
	|	И Шапка.Страхователь = &Страхователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления,
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.УстановитьПараметр("Страхователь", Страхователь);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Возврат Таблица[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ФиксируемыеРеквизиты()
	ФиксируемыеРеквизиты = Новый Соответствие;
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы = "ПодтверждениеПолучения";
	Шаблон.ОснованиеЗаполнения = "ИдентификаторСообщения";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТребуетсяПодтверждение");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаОтправкиПодтверждения");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ПодтверждениеПолученоСФР");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы = "НомерПроцесса";
	Шаблон.ОснованиеЗаполнения = "НомерПроцесса";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Страхователь");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВходящийЗапрос");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы = "ВходящийЗапрос";
	Шаблон.ОснованиеЗаполнения = "ВходящийЗапрос";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФизическоеЛицо");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы = "МаксимальнаяДатаПодтверждения";
	Шаблон.ОснованиеЗаполнения = "ДатаСообщения";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "МаксимальнаяДатаПодтверждения");
	
	// Добавление всех оставшихся реквизитов одной группой "по умолчанию".
	РеквизитыРучногоЗаполнения = "Ответственный, Комментарий";
	РеквизитыРучногоЗаполнения = Новый Структура(РеквизитыРучногоЗаполнения);
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ИмяГруппы                = "СлужебныеРеквизиты";
	Группа.ОтображатьПредупреждение = Ложь;
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		Если Не РеквизитыРучногоЗаполнения.Свойство(Реквизит.Имя)
			И ФиксируемыеРеквизиты[Реквизит.Имя] = Неопределено Тогда
			ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ФиксируемыеРеквизиты);
КонецФункции

#КонецОбласти

Процедура ПриЗаписиВходящегоЗапроса(ВходящийЗапрос) Экспорт
	// Искать уведомления имеет смысл только для входящих запросов которые могут быть просрочены.
	Если Не ВходящийЗапрос.Загружен Тогда
		Возврат; // Входящий запрос не загружен.
	КонецЕсли;
	Если ВходящийЗапрос.МаксимальнаяДатаОтвета >= НачалоДня(ТекущаяДатаСеанса()) Тогда
		Возврат; // Входящий запрос не просрочен.
	КонецЕсли;
	ЗначенияДоЗаписи = ВходящийЗапрос.ДополнительныеСвойства.ЗначенияРеквизитовДоЗаписи;
	Если Не ЗначенияДоЗаписи.ЭтоНовый
		И ЗначенияДоЗаписи.ОтветНаЗапрос = ВходящийЗапрос.ОтветНаЗапрос
		И ЗначенияДоЗаписи.Обработан = ВходящийЗапрос.Обработан
		И ЗначенияДоЗаписи.ФизическоеЛицо = ВходящийЗапрос.ФизическоеЛицо Тогда
		Возврат; // Ключевые значения не изменились.
	КонецЕсли;
	НомераПроцессов = Новый Массив;
	КоллекцииБЗК.ДобавитьНеПустоеЗначениеВМассив(НомераПроцессов, ВходящийЗапрос.НомерПроцесса);
	КоллекцииБЗК.ДобавитьНеПустоеЗначениеВМассив(НомераПроцессов, ЗначенияДоЗаписи.НомерПроцесса);
	Если НомераПроцессов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ОбновитьВторичныеДанныеПоНомерамПроцессов(НомераПроцессов);
КонецПроцедуры

Процедура ПриЗаписиОтветаНаЗапрос(ОтветНаЗапрос, НаборРегистраций) Экспорт
	// Прочие проверки для оптимизации.
	ЗначенияДоЗаписи = ОтветНаЗапрос.ДополнительныеСвойства.ЗначенияРеквизитовДоЗаписи;
	НомераПроцессов = Новый Массив;
	КоллекцииБЗК.ДобавитьНеПустоеЗначениеВМассив(НомераПроцессов, ОтветНаЗапрос.НомерПроцесса);
	КоллекцииБЗК.ДобавитьНеПустоеЗначениеВМассив(НомераПроцессов, ЗначенияДоЗаписи.НомерПроцесса);
	Если НомераПроцессов.Количество() = 0 Тогда
		Возврат; // Документ не заполнен (и не был заполнен до записи).
	КонецЕсли;
	Если Не ЗначенияДоЗаписи.ЭтоНовый
		И ЗначенияДоЗаписи.ВходящийЗапрос = ОтветНаЗапрос.ВходящийЗапрос
		И ЗначенияДоЗаписи.ДатаОтправки = ОтветНаЗапрос.ДатаОтправки
		И ЗначенияДоЗаписи.ФизическоеЛицо = ОтветНаЗапрос.ФизическоеЛицо
		И Не ЕстьИзмененияКлючевыхЗначенийВНабореРегистраций(НаборРегистраций) Тогда
		Возврат;
	КонецЕсли;
	// Поиск и обновление вторичных данных.
	ОбновитьВторичныеДанныеПоНомерамПроцессов(НомераПроцессов);
КонецПроцедуры

Процедура ПриЗаписиРегистрацииОтветаНаЗапрос(НаборРегистраций) Экспорт
	// Оптимизация - исключение повторного вызова.
	Если Не ЕстьИзмененияКлючевыхЗначенийВНабореРегистраций(НаборРегистраций) Тогда
		Возврат;
	КонецЕсли;
	НомераПроцессов = КоллекцииБЗК.УникальныеЗначенияКолонки(НаборРегистраций.Выгрузить(), "РегистрацияНомерПроцесса");
	Если НомераПроцессов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// Поиск и обновление вторичных данных.
	ОбновитьВторичныеДанныеПоНомерамПроцессов(НомераПроцессов);
КонецПроцедуры

Процедура ОбновитьВторичныеДанныеПоНомерамПроцессов(НомераПроцессов)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеОбОтсутствииОтветаСЭДО.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УведомлениеОбОтсутствииОтветаСЭДО КАК УведомлениеОбОтсутствииОтветаСЭДО
	|ГДЕ
	|	УведомлениеОбОтсутствииОтветаСЭДО.НомерПроцесса В(&НомераПроцессов)";
	Запрос.УстановитьПараметр("НомераПроцессов", НомераПроцессов);
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Объект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		Если Объект.ОбновитьВторичныеДанные() Тогда
			СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК", РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Определяет наличие изменений в наборе записей регистре РегистрацииОтветовНаЗапросыФССДляРасчетаПособий
//   важных для этого документа.
Функция ЕстьИзмененияКлючевыхЗначенийВНабореРегистраций(НаборРегистраций)
	// Оптимизация - исключение повторного вызова.
	Если НаборРегистраций.ДополнительныеСвойства.Свойство("УведомлениеОбОтсутствииОтветаОбновлено") Тогда
		Возврат Ложь;
	КонецЕсли;
	НаборРегистраций.ДополнительныеСвойства.Вставить("УведомлениеОбОтсутствииОтветаОбновлено", Истина);
	// Получение значений "до записи".
	ТаблицаДоЗаписи = ОбщегоНазначенияБЗК.ЗначениеСвойства(НаборРегистраций.ДополнительныеСвойства, "ЗначенияДоЗаписи");
	Если ТаблицаДоЗаписи = Неопределено Или ТаблицаДоЗаписи.Количество() = 0 Тогда
		Возврат Истина; // Новые записи.
	КонецЕсли;
	// Проверка наличия изменений.
	Для Каждого Запись Из НаборРегистраций Цикл
		СтрокаДоЗаписи = ТаблицаДоЗаписи.Найти(Запись.ИсходящийДокумент, "ИсходящийДокумент");
		Если СтрокаДоЗаписи = Неопределено
			Или СтрокаДоЗаписи.РегистрацияДата <> Запись.РегистрацияДата
			Или СтрокаДоЗаписи.Состояние <> Запись.Состояние Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецЕсли
